__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
position (InputLayer)           (None, 8, 8, 12)     0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 6, 6, 8)      872         position[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 4, 4, 16)     1168        conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 5, 5, 8)      1544        position[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 4, 4, 8)      2408        position[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 2, 2, 32)     4640        conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 16)     2064        conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 2, 2, 16)     1168        conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 3, 3, 8)      3464        position[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 2, 2, 8)      4712        position[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 1, 8)      6152        position[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 128)          0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 64)           0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 64)           0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 72)           0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 32)           0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 8)            0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 368)          0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
                                                                 flatten_4[0][0]                  
                                                                 flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
__________________________________________________________________________________________________
eval (Dense)                    (None, 1792)         661248      concatenate_1[0][0]              
==================================================================================================
Total params: 689,440
Trainable params: 689,440
Non-trainable params: 0
__________________________________________________________________________________________________
