{
 "class_name": "Model",
 "config": {
  "name": "model_1",
  "layers": [
   {
    "name": "position",
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      8,
      8,
      12
     ],
     "dtype": "float32",
     "sparse": false,
     "name": "position"
    },
    "inbound_nodes": []
   },
   {
    "name": "conv2d_1",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_1",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      3,
      3
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_2",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_2",
     "trainable": true,
     "filters": 16,
     "kernel_size": [
      3,
      3
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "conv2d_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_4",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_4",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      4,
      4
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_6",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_6",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      5,
      5
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_3",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_3",
     "trainable": true,
     "filters": 32,
     "kernel_size": [
      3,
      3
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "conv2d_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_5",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_5",
     "trainable": true,
     "filters": 16,
     "kernel_size": [
      4,
      4
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "conv2d_4",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_7",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_7",
     "trainable": true,
     "filters": 16,
     "kernel_size": [
      3,
      3
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "conv2d_6",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_8",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_8",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      6,
      6
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_9",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_9",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      7,
      7
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "conv2d_10",
    "class_name": "Conv2D",
    "config": {
     "name": "conv2d_10",
     "trainable": true,
     "filters": 8,
     "kernel_size": [
      8,
      8
     ],
     "strides": [
      1,
      1
     ],
     "padding": "valid",
     "data_format": "channels_last",
     "dilation_rate": [
      1,
      1
     ],
     "activation": "relu",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": {
      "class_name": "L1L2",
      "config": {
       "l1": 0.0,
       "l2": 0.009999999776482582
      }
     },
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "position",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_1",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_1",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_3",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_2",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_2",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_5",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_3",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_3",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_7",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_4",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_4",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_8",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_5",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_5",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_9",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "flatten_6",
    "class_name": "Flatten",
    "config": {
     "name": "flatten_6",
     "trainable": true,
     "data_format": "channels_last"
    },
    "inbound_nodes": [
     [
      [
       "conv2d_10",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "concatenate_1",
    "class_name": "Concatenate",
    "config": {
     "name": "concatenate_1",
     "trainable": true,
     "axis": -1
    },
    "inbound_nodes": [
     [
      [
       "flatten_1",
       0,
       0,
       {}
      ],
      [
       "flatten_2",
       0,
       0,
       {}
      ],
      [
       "flatten_3",
       0,
       0,
       {}
      ],
      [
       "flatten_4",
       0,
       0,
       {}
      ],
      [
       "flatten_5",
       0,
       0,
       {}
      ],
      [
       "flatten_6",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "name": "eval",
    "class_name": "Dense",
    "config": {
     "name": "eval",
     "trainable": true,
     "units": 1792,
     "activation": "softmax",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "VarianceScaling",
      "config": {
       "scale": 1.0,
       "mode": "fan_avg",
       "distribution": "uniform",
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "inbound_nodes": [
     [
      [
       "concatenate_1",
       0,
       0,
       {}
      ]
     ]
    ]
   }
  ],
  "input_layers": [
   [
    "position",
    0,
    0
   ]
  ],
  "output_layers": [
   [
    "eval",
    0,
    0
   ]
  ]
 },
 "keras_version": "2.1.6",
 "backend": "tensorflow"
}