_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
position (InputLayer)        (None, 8, 8, 12)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 768)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3584)              2756096   
_________________________________________________________________
dense_2 (Dense)              (None, 1792)              6424320   
_________________________________________________________________
eval (Dense)                 (None, 1792)              3213056   
=================================================================
Total params: 12,393,472
Trainable params: 12,393,472
Non-trainable params: 0
_________________________________________________________________
